{
    "version": "https://jsonfeed.org/version/1",
    "title": "ecotravelerin",
    "description": "",
    "home_page_url": "https://tanyaroy3112.github.io",
    "feed_url": "https://tanyaroy3112.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "vidya"
    },
    "items": [
        {
            "id": "https://tanyaroy3112.github.io/an-adventurous-weekend-getaway-to-chandratal.html",
            "url": "https://tanyaroy3112.github.io/an-adventurous-weekend-getaway-to-chandratal.html",
            "title": "An Adventurous Weekend Getaway to Chandratal",
            "content_html": "<p><strong>Chandratal is a high altitude sweet water lake in the highlands of Spiti, located at a height of 14500 ft. The source is underground water and it is the most mesmerizing sight you will come across in your life.</strong></p>\n<p><strong>Tour Details:</strong></p>\n<p><strong>No. of Travel Days:</strong> &nbsp;3 nights/ 4 Days</p>\n<p><strong>Best Season:</strong> July - Sept</p>\n<p><strong>Max. Altitude: </strong>5000 m</p>\n<p><strong>Accommodation:</strong> Homestays, Camps</p>\n<p><strong>Transportation: </strong>MUVs</p>\n<p><strong>Price Design:</strong></p>\n<p><strong>2-4 persons: 13,500</strong></p>\n<p><strong>5-9 persons: INR 8,500</strong></p>\n<p>Day 1 Manali</p>\n<p>Arrive at Manali in the morning, stay will be arranged in a country side guest house in Old Manali. Spend the day Relaxing and local sight-seeing in Manali. One can visit Hadimba temple, Vashisht or just take it easy in caf&eacute;&rsquo;s in Old Manali.</p>\n<p><strong><u>&nbsp;</u></strong></p>\n<p>Day 2: Manali to Kunzum Pass Via Rohtang Pass</p>\n<p>The day will begin early in the road, Manali to Kunzum Pass is about a 6 hour drive with constant change in landscape and altitude. Drinking a lot of water is the key to remain healthy. We will cross Chhatru and have Lunch at the very famous Chandra Dhaba in Batal run by the very famous Chacha and Chachi who were recognized by the Govt of India for saving lives of 110 people in 2010 during Uttarakhand floods.Trek: Our campsite for the night is about 11 kms from Batal, however there is a lesser known trek from Kunzum Pass to Chandratal which is about 13kms (4-5 hours) for the braver and fitter one&rsquo;s. You will have a choice between driving there or trekking. We reach the camp by early evening, acclimatize and take rest</p>\n<p><strong><u>&nbsp;</u></strong></p>\n<p>Day 3: Chandratal Circle</p>\n<p>We spent the whole of next day from morning till early evening watching different shades of the magical and pristine Chandratal Lake. It changes shades from being mirror to turning blue as the suns position and direction of the wind changes. The circle is about 4 kms walk offering angles. A paradise for photographers. We come back to campsite and night and Make Merry.</p>\n<p><strong><u>&nbsp;</u></strong></p>\n<p>Day 4: Chandratal - Manali</p>\n<p>We leave early morning for Manali and arrive by post noon, one can take a bus back to Delhi the same evening</p>\n<p><strong><u>&nbsp;</u></strong></p>\n<p><strong><u>&nbsp;</u></strong></p>\n<p><strong><u>Trip Guidelines</u></strong></p>\n<p>&nbsp;</p>\n<p>Hello Fellow Travelers,</p>\n<p>Thank you for choosing Eco-Traveler, at the offset we are extremely excited and totally looking forward to host a memorable trip for you. We love living in outdoors and the adrenaline, we also believe that it is truly the greatest gift of God, the beauty and magic outdoors, hence the need to respect it. We are laying very basic and easy to do guidelines for the same with the motive of leaving minimum footprint, preserving the flora, fauna, biodiversity and ecology of the region along with coming close to local communities and culture of the region. We truly believe that you will help us in initiating this and become an Eco-Traveler, if not already one.</p>\n<p><strong>&nbsp;</strong></p>\n<p><strong>A little on what Ecotourism exactly is</strong></p>\n<p>A dictionary defines it as \"tourism directed towards unspoilt natural environments and intended to support conservation efforts\". In addition, Eco-Traveler believes in supporting, protection and at the same time experiencing local culture and heritage. Tourism results in social, as well as environmental impacts, and a responsible tourist needs to be aware of this.</p>\n<p><strong>&nbsp;</strong></p>\n<p><strong>Here is how you can help</strong></p>\n<p>Carrying <strong>your own</strong> water bottle, cups, plates and filling water from natural resource, <strong>drinking locally brewed products</strong> served in glass or recyclable materials.</p>\n<p>Using litter bins to trash items that do not decompose, <strong>minimum use of purchases packed in plastic</strong>, carry a <strong>waste bag</strong> for your personal non-biodegradable waste.</p>\n<p>Enjoying watching the <strong>biodiversity</strong> of the geography<strong>, not playing loud music or being loud</strong>, when we go outdoors, we are borrowing home of animals and birds, it&rsquo;s our responsibility to ensure they are not disturbed.</p>\n<p>Purchasing locally produced items- from handicrafts to breweries to savories</p>\n<p>Keeping minimum carbon footprint and <strong>nil plastic footprints</strong> on the trail through not burning plastic or wood.</p>\n<p>&nbsp;</p>\n<p><strong>Things an Eco-Traveler carries</strong></p>\n<p>Apart from personal clothing and toiletries following items need to be carried in order to make this do it yourself and minimum footprint trek and also for your personal convenience-</p>\n<p>Carry your own water bottle, tea up and a tiffin box for packing lunch, instead of using disposable packing material. Water bottle with filters are available, however the natural resources are clean and pristine. It&rsquo;s good to carry dry fruits and nuts for personal use.</p>\n<p>Carry a day bag pack, we will provide potters for those need it, however only essentials can be carried for an overnight trek in a day pack.</p>\n<p>A waste bag to collect waste on the way in your day pack.</p>\n<p>&nbsp;</p>\n<p>Travel light and easy to enjoy the true essence of backpacking!</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong><u>Inclusions and Exclusions:</u></strong></p>\n<p>&nbsp;</p>\n<p><strong>Trip Cost Includes</strong></p>\n<p><strong>&nbsp;</strong></p>\n<p><strong>&nbsp;</strong></p>\n<ul>\n<li>Pick up from Manali and drop at Manali</li>\n<li>One night stay in Manali</li>\n<li>All camp meals</li>\n<li>All accommodation during the trek</li>\n<li>All transportation, tourist service charge, VAT and Office Service charge</li>\n<li>Guide and porter for the trek and all expenses pertaining to them</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>&nbsp;</strong></p>\n<p><strong>Trip Cost Excludes</strong></p>\n<p><strong>&nbsp;</strong></p>\n<ul>\n<li>All bar bills, beverages such as coke, fanta, sprite and mineral water (We do not encourage bottled drinks as it generates plastic)</li>\n<li>Travel insurance</li>\n<li>Personal Equipment&rsquo;s and rescue operation in case of emergency</li>\n<li>Any expenses which arise due to a change of the itinerary, because of landslides, political trouble, and strikes etc.</li>\n<li>Laundry, phone calls, internet, heater charge and wifi services.</li>\n<li>Tips for guide, porters, and driver.</li>\n<li>Any meals on the trek</li>\n<li>Area Permit &amp; TIMS Cards.</li>\n</ul>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Note: This trip can be personalized as per your requirements that meet your time frame. The trip price will be according to Deluxe, Standard, Budget and group size so please kindly provide us your details for tailor made program.</p>\n<p>&nbsp;</p>\n<p><strong>&nbsp;</strong></p>\n<p><strong>&nbsp;</strong></p>\n<p><strong>Trip Undertaking</strong></p>\n<p>&nbsp;</p>\n<p>Traveling and Trekking in high altitudes require basic fitness and mental endurance, our team will ensure successful completion and will provide guidance and support, in case of an unforeseen event however, we will handle it to the best of our capacity, and the ultimate responsibility lies with each traveler.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong>&nbsp;</strong></p>",
            "image": "https://tanyaroy3112.github.io/media/posts/2/Chandratal.jpg",
            "author": {
                "name": "vidya"
            },
            "tags": [
            ],
            "date_published": "2017-12-16T14:19:54+05:30",
            "date_modified": "2017-12-16T14:19:54+05:30"
        }
    ]
}
